In [3]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
from matplotlib.patches import Rectangle

In [4]:
pd.read_csv('/workspaces/DataSets_CruzKimFranco/Data/Raw/vgsalesGlobale.csv')

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [6]:
pd.read_csv('/workspaces/DataSets_CruzKimFranco/Data/Raw/BTC-Daily.csv')

,unix,date,symbol,open,high,low,close,Volume BTC,Volume USD
0,1646092800,01/03/2022 00:00,BTC/USD,43221.71,43626.49,43185.48,43185.48,4.900629e+01,2.116360e+06
1,1646006400,28/02/2022 00:00,BTC/USD,37717.10,44256.08,37468.99,43178.98,3.160618e+03,1.364723e+08
2,1645920000,27/02/2022 00:00,BTC/USD,39146.66,39886.92,37015.74,37712.68,1.701817e+03,6.418008e+07
3,1645833600,26/02/2022 00:00,BTC/USD,39242.64,40330.99,38600.00,39146.66,9.127241e+02,3.573010e+07
4,1645747200,25/02/2022 00:00,BTC/USD,38360.93,39727.97,38027.61,39231.64,2.202852e+03,8.642149e+07
...,...,...,...,...,...,...,...,...,...
2646,1417478400,02/12/2014 00:00,BTC/USD,378.39,382.86,375.23,379.25,2.593576e+06,6.832530e+03
2647,1417392000,01/12/2014 00:00,BTC/USD,376.40,382.31,373.03,378.39,2.520662e+06,6.660560e+03
2648,1417305600,30/11/2014 00:00,BTC/USD,376.57,381.99,373.32,373.34,1.145567e+06,3.046330e+03
2649,1417219200,29/11/2014 00:00,BTC/USD,376.42,386.60,372.25,376.72,2.746157e+06,7.245190e+03
2650,1417132800,28/11/2014 00:00,BTC/USD,363.59,381.34,360.57,376.28,3.220878e+06,8.617150e+03

In [13]:
pd.read_csv('/workspaces/DataSets_CruzKimFranco/Data/Raw/application_record.csv')

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
438552,6840104,M,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,-22717,365243,1,0,0,0,NaN,1
438553,6840222,F,N,N,0,103500.0,Working,Secondary / secondary special,Single / not married,House / apartment,-15939,-3007,1,0,0,0,Laborers,1
438554,6841878,F,N,N,0,54000.0,Commercial associate,Higher education,Single / not married,With parents,-8169,-372,1,1,0,0,Sales staff,1
438555,6842765,F,N,Y,0,72000.0,Pensioner,Secondary / secondary special,Married,House / apartment,-21673,365243,1,0,0,0,NaN,2
438556,6842885,F,N,Y,0,121500.0,Working,Secondary / secondary special,Married,House / apartment,-18858,-1201,1,0,1,0,Sales staff,2

In [14]:
df_ventasglobales=pd.read_csv('/workspaces/DataSets_CruzKimFranco/Data/Raw/vgsalesGlobale.csv')
df_BTC=pd.read_csv('/workspaces/DataSets_CruzKimFranco/Data/Raw/BTC-Daily.csv')
df_credit=pd.read_csv('/workspaces/DataSets_CruzKimFranco/Data/Raw/application_record.csv')

In [ ]:
#para mostrar los 5 primeros registros es: df_#nombre.head(5)
#para mostrar los 5 últimos registros es: df_#nombre.tail(5)
#para mostrar 5 registros aleatorios es: df_#nombre.sample(5)
#para ver el tamaño de la base se usa .shape (Filas.Columnas)
#para depuraruna base, se puede usar ".drop" seguido de lo que se quiere eliminar, esto eliminaría toda la fila
#cuando son registros que incluyen NA pero se desea mantener el resto de la información se puede utilizar el comando
#".fillna(0)" y lo sustituye por cero

## Descripción de mis Variables

In [8]:
#las variables que utilizare en el data set de vgsalesGlobales, serán:
#Genre: Genero
#Platform: Plataforma
#Global_Sales
#Publisher: estudio que lo desarrolló

#estas variables me ayudarán a ver que publicante tiene mayor ventas, en que plataforma y que generó tienen más éxito en ventas

In [14]:
df_ventasglobales [['Genre','Platform','Global_Sales','Publisher']]

              Genre Platform  Global_Sales   Publisher
0            Sports      Wii         82.74    Nintendo
1          Platform      NES         40.24    Nintendo
2            Racing      Wii         35.82    Nintendo
3            Sports      Wii         33.00    Nintendo
4      Role-Playing       GB         31.37    Nintendo
...             ...      ...           ...         ...
16593      Platform      GBA          0.01       Kemco
16594       Shooter       GC          0.01  Infogrames
16595        Racing      PS2          0.01  Activision
16596        Puzzle       DS          0.01    7G//AMES
16597      Platform      GBA          0.01     Wanadoo

[16598 rows x 4 columns]

In [ ]:
#en mi data set de BTC intento predecir el precio del Bitcoin por medio de estacionalidad
#lo que intento es ver que días del año y semana, se ven más impulsado el precio a la alza y a la baja
#como primer ejercicio busco ver las variables de día, precio de cierre y hacer una segmencación por semana, mes y día para ver que días 
#es más conveniente invertir y cuando retirar para maximizar ganancias

In [16]:
df_BTC[['date','close']]

                  date     close
0     01/03/2022 00:00  43185.48
1     28/02/2022 00:00  43178.98
2     27/02/2022 00:00  37712.68
3     26/02/2022 00:00  39146.66
4     25/02/2022 00:00  39231.64
...                ...       ...
2646  02/12/2014 00:00    379.25
2647  01/12/2014 00:00    378.39
2648  30/11/2014 00:00    373.34
2649  29/11/2014 00:00    376.72
2650  28/11/2014 00:00    376.28

[2651 rows x 2 columns]

In [ ]:
#en el data set de aplicaciones a tarjetas de crédito, quiero ver que usuarios y variables
#son las que generan mayor ingreso por medio de AMT Income

In [23]:
df_credit[['CODE_GENDER','FLAG_OWN_CAR','FLAG_OWN_REALTY','CNT_CHILDREN','AMT_INCOME_TOTAL','NAME_INCOME_TYPE','NAME_EDUCATION_TYPE']]

,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE
0,M,Y,Y,0,427500.0,Working,Higher education
1,M,Y,Y,0,427500.0,Working,Higher education
2,M,Y,Y,0,112500.0,Working,Secondary / secondary special
3,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special
4,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special
...,...,...,...,...,...,...,...
438552,M,N,Y,0,135000.0,Pensioner,Secondary / secondary special
438553,F,N,N,0,103500.0,Working,Secondary / secondary special
438554,F,N,N,0,54000.0,Commercial associate,Higher education
438555,F,N,Y,0,72000.0,Pensioner,Secondary / secondary special
438556,F,N,Y,0,121500.0,Working,Secondary / secondary special